[
	{
		"name": "Manjari Edwards - 07/2024",
		"text": "<b><i>Purpose Driven leader, who helps purpose driven people on their career path, thereby builds tools and technologies for the product.</i></b><br /><i>(July 18, 2024, Manjari managed Brent directly)</i><br /><br />Brent is an experienced iOS Engineer with over 10 years of experience in iOS app development. Brent has consistently demonstrated a strong proficiency in developing innovative and user-friendly iOS applications, making significant contributions to every project he has been a part of. Throughout our time working together, I have been consistently impressed with Brent's technical expertise and problem-solving skills. His deep knowledge of iOS development best practices, combined with his ability to adapt to changing technologies, ensures that the apps he develops are of the highest quality and functionality.<br /><br />In addition to his technical skills, Brent is a great team player who actively collaborates with his colleagues and is always willing to offer his expertise and assistance. His excellent communication skills and strong work ethic make him a valuable asset to any team. Brent is direct in feedback, agile mindset person and can help teams that needs honest guidance. His passion for his work, dedication to excellence, and unwavering commitment to producing top-notch applications make him an exceptional candidate.<br /><br />"
	},
	{
		"name": "Benjamin Hotrabhavananda - 06/2024",
		"text": "I had the pleasure of working with Brent at Edward Jones, where our paths frequently crossed, particularly during code reviews. <b><i>Brent consistently impressed me with his exceptional debugging skills and his calm, methodical approach to solving complex issues. His ability to remain composed under pressure and provide insightful suggestions was invaluable to my work.<br /><br >Brent is also a fearless leader within our iOS team chapter meetings.</i></b> He fosters an environment of open communication and support, making himself approachable and always available to assist. One memorable instance was when he went out of his way to help me debug a particularly challenging piece of code. His guidance not only resolved the issue but also enhanced my understanding of the problem.<br /><br >Brent's dedication, problem-solving skills, and leadership qualities make him an outstanding asset to any team. I highly recommend him and am confident that he will excel in any future endeavors.<br /><br >Five stars for Brush & Bark! Their attention to detail is impeccable. My poodle, Coco, had her nails done perfectly. The salon is clean, and the staff is super friendly.<br /><br >"
	},
	{
		"name": "Praveen Miranda - 03/2024",
		"text": "I have worked with Brent for almost 3 years at Edward Jones on the same team. <b><i>He is absolutely a phenomenal iOS Developer. He has very deep knowledge of the iOS frameworks, languages like Swift, Objective-C and other arsenal in a typical iOS Developer's toolkit.</i></b> We have worked closely on multiple awesome features for Edward Jones applications. He is always up for learning and trying out new things. He is very confident in his skills and generally believes nothing is impossible to do with some code. A true professional who writes very high quality code and works very well in a team environment. He is always ever ready to help other people on the team when they need help. I would highly recommend him to anyone looking to hire him."
	},
	{
		"name": "Dave Pedersen - 02/2024",
		"text": "Brent was a fantastic to have as a fellow iOS developer. He constantly strived to not only create the most efficient code possible , but also to improve existing code to best standards and practices. He brought humor and insight to our meetings. I hope I will get the opportunity to work with him again"
	},
	{
		"name": "Dan Benner - 02/2024",
		"text": "Brent is an accomplished developer and an outspoken leader. <b><i>He demonstrated on a daily basis his expertise in all things iOS related. He has a passion for learning and an even greater enthusiasm for teaching.</b></i> He isn't afraid to challenge the status quo while maintaining a firm stance on always improving what can be improved. I would gladly work alongside Brent in any regard."
	},
	{
		"name": "Kaz Michael Karl - 03/2013",
		"text": "I think of myself as one of <i>the best of the best of the best</i>, and that's what the team I was on with Brent was intended by Taleisin to be, on the Boeing 787 project. They called us the Four Musketeers, and we were brought in to rescue a project that was only five weeks from deadline, but months from completion. Despite one member proving inadequate and dropping out, we got the project done essentially on time, surpassing expectations.<br /><br />That is the competitive setting to keep in mind when I say that <b><i>I was astonished with how skilled Brent is. It's the first time in over a decade that I felt like I had someone I wanted to <i>be like</i>, instead of feeling I am the role model for others on a given project. His ability to absorb and refactor an entire code base is beyond what I realized people could do, an ability worth striving to emulate.<br /><br />He also has unusually good character, and more people skill than most techies, which is a huge advantage in the development world</i></b>, helping facilitate the communication necessary to get multi-member projects coordinated and done well<br /><br />"
	},
	{
		"name": "Derrick Baier - 10/2012",
		"text": "Brent has been an amazing addition to NJVC. <b><i>His experience in web and software development lifecycle is bar none and he is focused on the success of the company. Highly recommended</i></b>"
	},
	{
		"name": "Calvin Horrell - 01/2010",
		"text": "Brent is an outstanding resource if you have any Perl or Unix resource needs. I know he has been expanding his knowledge base over the past few years and can also contribute in other areas. He did a fantastic job for us at three different client sites prior to converting to be a full time employee after the last client assignment we had for him"
	},
	{
		"name": "Josh Bahr - 12/2009",
		"text": "Brent has worked for Technology Partners on 3 seperate contracts over the 10 years I have been with the company. Our clients were all very pleased with Brent's ability to add value to their projects as a software developer."
	},
	{
		"name": "Todd Stoner - 12/2009",
		"text": "In my 5 years as CFO for Technology Partners, Brent worked for Technology Partners as an IT contractor for several of our clients. The clients were very pleased with his work. This was evidenced by the amount of time he was retained by the clients and the positive feedback we received from the client project managers. Brent has both a great attitude and a great work ethic."
	}
]
